<template>
  <div class="agree-wrapper">
    <p class="title big-title">运营商注册协议</p>
    <p class="text">尊敬的运营商，欢迎注册成为杭州企鹅科技有限公司平台（以下简称“本平台”）用户。在注册本平台之前，请务必认真阅读并充分理解本协议全部内容，并请您审慎阅读并选择接受或不接受本协议。点击本协议下方的“注册”按钮，并按照本平台注册程序进行注册 ，上述注册程序完成时即视为用户已经充分理解和同意本协议全部内容，并签署了本协议，本协议已在用户与本公司之间产生合同法律效力，用户使用本平台服务的全部活动将受到本协议的约束并应承担相应的责任和义务。</p>
    <p class="title">1、运营商注册须知</p>
    <p class="text">1.1 注册成为本平台用户运营商必须满足如下相应主体资格条件之一：</p>
    <p class="text indent">1) 年龄在 18 周岁以上，且具有完全的民事权利能力及民事行为能力；</p>
    <p class="text indent">2) 在中国境内注册成立并经营的具备民事行为能力且能独立承担民事义务的法人；</p>
    <p class="text indent">3) 在中国境内依法成立的其他组织。</p>
    <p class="text">1.2 完成本平台注册程序并通过认证的用户即成为正式用户，可以获得本平台用户应享有的权限；</p>
    <p class="text">1.3 在注册和使用本平台服务期间，用户应根据本平台的要求提供自身的真实资料和信息，并保证自注册之时起至使用本平台服务期间，其所提交的所有资料和信息（包括但不限于真实姓名/名称、电子邮件地址、联系电话、身份信息等）真实、准确、完整、有效和合法。如有变更，应及时更新，如因用户未及时更新信息和资料导致本平台无法提供服务，由此产生的法律责任和后果由用户自担。如使用他人信息和文件注册使用本平台服务或向本平台提供的信息和资料不符合上述规定，由此引起的一切责任和后果均由用户自担，本公司及本平台不因此承担任何法律责任，如因此给本公司或本平台造成损失，用户应当承担赔偿责任。</p>
    <p class="title">2、平台服务内容及服务费用</p>
    <p class="text">2.1 本平台向用户提供管理店铺设备、收益提现等等服务。</p>
    <p class="text">2.2 用户使用本平台服务时，本公司有权收取服务费用，具体服务费用收取标准以本平台公告或者本公司与用户另行签订的相关协议为准。用户在此不可撤销地承诺，将按照用户签署的相关协议约定向本公司支付服务费用，同意并授权本平台自其有关账户中直接扣划服务费用。</p>
    <p class="title">3、用户使用规则</p>
    <p class="text">3.1 在使用本平台时，用户不得违反下述规定，如违反任意一条，本平台有权基于独立判断直接删除用户在本平台上作出的相关信息，有权要求用户改正或直接采取必要的措施禁止（包括但不限于中止、终止、限制用户使用本平台服务）而无需通知用户，亦无需承担任何责任。如因此给本公司及本平台造成损失的，用户应当赔偿本公司及本平台的损失。</p>
    <p class="text">（1） 不得为任何非法目的而使用网络服务系统</p>
    <p class="text">（2） 遵守所有与网络服务有关的网络协议、规定和程序；</p>
    <p class="text">（3） 不得利用本平台进行任何可能对互联网的正常运转造成不利影响的行为；</p>
    <p class="text">（4） 不得利用本平台进行任何不利于本平台或侵犯本公司利益的行为或言论。</p>
    <p class="text">3.2 用户在注册时向本平台提交的电子邮箱、用户名、密码及安全问题答案是用户在本平台的唯一识别信息。用户注册成功后，应当妥善保管用户名和密码，并对自己的用户名、密码安全性负责，不得将注册的电子邮箱、用户名、密码及安全问题答案转让、赠与或授权给第三方使用。用户确认使用用户名和密码登陆本平台后在本平台的一切行为以及以用户在本平台注册时提交的电子邮箱发送邮件的行为均为用户本人操作，并承担相应的法律后果，本公司及本平台不承担任何责任。</p>
    <p class="text">3.3 协助义务：用户如发现有第三人冒用或盗用用户账户及密码，或其他任何未经合法授权的情形，应立即以有效方式通知本平台，要求本平台暂停相关服务，否则由此产生的一切责任由用户自担。同时，用户理解并同意本平台对其提出的请求采取行动需要合理期限，在此之前，本平台对第三人使用该服务所导致的损失不承担任何责任。</p>
    <p class="text">3.4 用户同意，账户的暂停、中断或终止不代表用户责任的终止，用户仍应对使用本平台服务期间的行为承担可能的违约或损害赔偿责任，同时本平台仍可保有用户的相关信息。</p>
    <p class="title">4、知识产权</p>
    <p class="text">4.1 本平台的所有内容，包括但不限于文本、数据、图片、音频、视频、源代码、洗衣机自助模块信息等，均由本公司享有知识产权。未经本平台事先书面同意，不得复制、模仿、改编、传播、公布、展示或以任何其他方式侵犯本平台的知识产权。未经本公司书面同意,用户不得将本平台包含的资料等任何内容发布到任何其他平台或者服务器。任何未经授权对本平台内容的使用均属于违法行为，本公司有权追究法律责任。</p>
    <p class="title">5、用户隐私保护及授权</p>
    <p class="text">5.1 用户同意本平台在业务运营中收集和储存用户信息，包括但不限于用户自行提供的资料和信息，以及本平台自行收集、取得的用户在本平台的交易记录和使用信息等。</p>
    <p class="text">5.2 本平台不对外公开或第三方提供单个用户的注册资料及用户在使用网络服务时存储在本平台的非公开内容，但下列情况除外：</p>
    <P class="text">（1） 事先获得用户的明确授权</P>
    <p class="text">（2） 根据有关的法律法规要求；</p>
    <p class="text">（3） 按照相关政府主管部门的要求；</p>
    <p class="text">（4） 为维护社会公众的利益。</p>
    <p class="title">6、责任限制</p>
    <p class="text">6.1 运营商明确同意使用本平台网络服务，所存在的风险及一切后果由运营商自行承担。本平台不承担任何责任。</p>
    <p class="text">6.2 对于因不可抗力或本站不能控制的原因造成的网络服务中断或其他缺陷，本平台不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</p>
    <p class="text">6.3 无论如何，本公司对用户承担的违约赔偿（如有）总额不超过向用户收取的服务费用总额</p>
    <p class="title">7、风险提示</p>
    <p class="text">7.1 用户了解并认可，任何通过本平台进行的交易并不能避免以下风险的产生，本平台不能也没有义务为如下风险负责：</p>
    <p class="text indent">1）因宏观经济形势变化，可能引起价格等方面的异常波动，用户有可能遭受损失；</p>
    <p class="text indent">2）因有关法律、法规及相关政策、规则发生变化，可能引起价格等方面异常波动，用户有可能遭受损失；</p>
    <p class="text indent">3）因其他交易方无力或无意愿按时足额履约，运营商有可能遭受损失；</p>
    <p class="text indent">4）市场利率变化可能对购买或持有产品的实际收益产生影响；</p>
    <p class="text indent">5）不可抗力因素导致的风险；</p>
    <p class="text indent">6）因用户的过错导致的任何损失 ，该过错包括但不限于：操作不当、遗忘或泄露密码、密码被他人破解、用户使用的计算机系统被第三方侵入、用户委托他人代理交易时他人恶意或不当操作而造成的损失。</p>
    <p class="text">7.3 以上并不能揭示用户通过本平台进行交易的全部风险及市场的全部情形。用户在做出交易决策前，应全面了解相关交易，谨慎决策，并自行承担全部风险</p>
    <p class="title">8、附则</p>
    <p class="text">8.1 本协议的订立、执行、解释及争议解决均适用中华人民共和国法律（不包括香港、澳门、台湾地区）。</p>
    <p class="text">8.2本协议部分无效不影响其它部分效力。本平台对本协议拥有最终的解释权。</p>
    <p class="text">8.3 如果你是本平台注册用户，本协议条款将对用户持续有效，有效期至用户注销或者被关闭账户后。</p>
    <p class="text">8.4 如有任何争议，应友好协商解决，协商不成，应提交本公司所在地有管辖权的法院诉讼解决。</p>
  </div>
</template>

<script>
</script>

<style lang="scss" scoped="scoped">
@import "~@//styles/variables.scss";
.agree-wrapper {
  width: 80%;
  margin: 20px auto;
  .title {
    font-size: 16px;
    color: $menuText;
    padding: 15px 0;
    line-height: 32px;
  }
  .big-title {
    font-size: 24px;
    text-align: center;
  }
  .text {
    font-size: 14px;
    color: #8a8fab;
    line-height: 32px;
  }
  .indent {
    text-indent: 2em;
  }
}
</style>